IRP/src/AccumulationRegisters/R6070T_OtherPeriodsExpenses/R6070T_OtherPeriodsExpenses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R6070T_OtherPeriodsExpenses</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AmountTax</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DocumentRef.PurchaseInvoice</types>
   <types>DocumentRef.ExpenseAccruals</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>OtherPeriodExpenseType</name>
  <type>
   <types>EnumRef.OtherPeriodExpenseType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/ChartsOfCharacteristicTypes/CurrencyMovementType/CurrencyMovementType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
 <name>CurrencyMovementType</name>
 <type>
  <types>EnumRef.CurrencyType</types>
 </type>
 <predefined>
  <items>
   <name>SettlementCurrency</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_PartnerTerm</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_Legal</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
 </predefined>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Source</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CurrencyType</types>
  </type>
 </attributes>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NotPostIfRateNotSet</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>EverydayRates</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/AccumulationRegisters/R6070T_OtherPeriodsExpenses/ManagerModule.bsl
Function CheckBalance(Ref, CurrentRecords, ExistsRecords, Unposting, AddInfo = Undefined) Export
	
	If Not PostingServer.CheckingBalanceIsRequired(Ref, "CheckBalance_R6070T_OtherPeriodsExpenses", True) Then
		Return True;
	EndIf;
	
	Query = New Query();
	Query.TempTablesManager = New TempTablesManager();
	Query.Text = 
	"SELECT
	|	CurrentRecords.Company,
	|	CurrentRecords.Branch,
	|	CurrentRecords.RowID,
	|	CurrentRecords.Basis,
	|	CurrentRecords.ItemKey,
	|	CurrentRecords.Currency,
	|	CurrentRecords.OtherPeriodExpenseType,
	|	CurrentRecords.ExpenseType,
	|	CurrentRecords.ProfitLossCenter,
	|	VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency) AS CurrencyMovementType
	|INTO CurrentRecords
	|FROM
	|	&CurrentRecords AS CurrentRecords
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ExistsRecords.Company,
	|	ExistsRecords.Branch,
	|	ExistsRecords.RowID,
	|	ExistsRecords.Basis,
	|	ExistsRecords.ItemKey,
	|	ExistsRecords.Currency,
	|	ExistsRecords.OtherPeriodExpenseType,
	|	ExistsRecords.ExpenseType,
	|	ExistsRecords.ProfitLossCenter,
	|	ExistsRecords.CurrencyMovementType
	|INTO ExistsRecords
	|FROM
	|	&ExistsRecords AS ExistsRecords
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	CurrentRecords.Company,
	|	CurrentRecords.Branch,
	|	CurrentRecords.RowID,
	|	CurrentRecords.Basis,
	|	CurrentRecords.ItemKey,
	|	CurrentRecords.Currency,
	|	CurrentRecords.OtherPeriodExpenseType,
	|	CurrentRecords.ExpenseType,
	|	CurrentRecords.ProfitLossCenter,
	|	CurrentRecords.CurrencyMovementType
	|INTO AllRecords
	|FROM
	|	CurrentRecords AS CurrentRecords
	|WHERE
	|	NOT &Unposting
	|
	|UNION ALL
	|
	|SELECT
	|	ExistsRecords.Company,
	|	ExistsRecords.Branch,
	|	ExistsRecords.RowID,
	|	ExistsRecords.Basis,
	|	ExistsRecords.ItemKey,
	|	ExistsRecords.Currency,
	|	ExistsRecords.OtherPeriodExpenseType,
	|	ExistsRecords.ExpenseType,
	|	ExistsRecords.ProfitLossCenter,
	|	ExistsRecords.CurrencyMovementType
	|FROM
	|	ExistsRecords AS ExistsRecords
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	AllRecords.Company,
	|	AllRecords.Branch,
	|	AllRecords.RowID,
	|	AllRecords.Basis,
	|	AllRecords.ItemKey,
	|	AllRecords.Currency,
	|	AllRecords.OtherPeriodExpenseType,
	|	AllRecords.ExpenseType,
	|	AllRecords.ProfitLossCenter,
	|	AllRecords.CurrencyMovementType
	|INTO GroupedRecords
	|FROM
	|	AllRecords AS AllRecords
	|WHERE
	|	AllRecords.CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)
	|GROUP BY
	|	AllRecords.Company,
	|	AllRecords.Branch,
	|	AllRecords.RowID,
	|	AllRecords.Basis,
	|	AllRecords.ItemKey,
	|	AllRecords.Currency,
	|	AllRecords.OtherPeriodExpenseType,
	|	AllRecords.ExpenseType,
	|	AllRecords.ProfitLossCenter,
	|	AllRecords.CurrencyMovementType
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	R6070T_OtherPeriodsExpensesBalance.Company,
	|	R6070T_OtherPeriodsExpensesBalance.Branch,
	|	R6070T_OtherPeriodsExpensesBalance.RowID,
	|	R6070T_OtherPeriodsExpensesBalance.Basis,
	|	R6070T_OtherPeriodsExpensesBalance.ItemKey,
	|	R6070T_OtherPeriodsExpensesBalance.Currency,
	|	R6070T_OtherPeriodsExpensesBalance.OtherPeriodExpenseType,
	|	R6070T_OtherPeriodsExpensesBalance.ExpenseType,
	|	R6070T_OtherPeriodsExpensesBalance.ProfitLossCenter,
	|	R6070T_OtherPeriodsExpensesBalance.CurrencyMovementType,
	|	-R6070T_OtherPeriodsExpensesBalance.AmountBalance AS LackOfBalance
	|FROM
	|	AccumulationRegister.R6070T_OtherPeriodsExpenses.Balance(, (Company, Branch, RowID, Basis, ItemKey, Currency,
	|		OtherPeriodExpenseType, ExpenseType, ProfitLossCenter, CurrencyMovementType) IN
	|		(SELECT
	|			GroupedRecords.Company,
	|			GroupedRecords.Branch,
	|			GroupedRecords.RowID,
	|			GroupedRecords.Basis,
	|			GroupedRecords.ItemKey,
	|			GroupedRecords.Currency,
	|			GroupedRecords.OtherPeriodExpenseType,
	|			GroupedRecords.ExpenseType,
	|			GroupedRecords.ProfitLossCenter,
	|			GroupedRecords.CurrencyMovementType
	|		FROM
	|			GroupedRecords AS GroupedRecords)) AS R6070T_OtherPeriodsExpensesBalance
	|		INNER JOIN GroupedRecords AS GroupedRecords
	|		ON R6070T_OtherPeriodsExpensesBalance.Company = GroupedRecords.Company
	|		AND R6070T_OtherPeriodsExpensesBalance.Branch = GroupedRecords.Branch
	|		AND R6070T_OtherPeriodsExpensesBalance.RowID = GroupedRecords.RowID
	|		AND R6070T_OtherPeriodsExpensesBalance.Basis = GroupedRecords.Basis
	|		AND R6070T_OtherPeriodsExpensesBalance.ItemKey = GroupedRecords.ItemKey
	|		AND R6070T_OtherPeriodsExpensesBalance.Currency = GroupedRecords.Currency
	|		AND R6070T_OtherPeriodsExpensesBalance.OtherPeriodExpenseType = GroupedRecords.OtherPeriodExpenseType
	|		AND R6070T_OtherPeriodsExpensesBalance.ExpenseType = GroupedRecords.ExpenseType
	|		AND R6070T_OtherPeriodsExpensesBalance.ProfitLossCenter = GroupedRecords.ProfitLossCenter
	|		AND R6070T_OtherPeriodsExpensesBalance.CurrencyMovementType = GroupedRecords.CurrencyMovementType
	|WHERE
	|	R6070T_OtherPeriodsExpensesBalance.AmountBalance < 0";
	
	Query.SetParameter("CurrentRecords", CurrentRecords);
	Query.SetParameter("ExistsRecords", ExistsRecords);
	Query.SetParameter("Unposting", Unposting);
	
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();

	Error = False;
	While QuerySelection.Next() Do
		Error = True;
		Message = StrTemplate(R().Error_183, QuerySelection.Basis, QuerySelection.Currency, QuerySelection.LackOfBalance);
		CommonFunctionsClientServer.ShowUsersMessage(Message);
	EndDo;
	Return Not Error;
EndFunction

#Region AccessObject

// Get access key.
// See Role.TemplateAccumulationRegisters - Parameters orders has to be the same
// 
// Returns:
//  Structure - Get access key:
// * Company - CatalogRef.Companies -
// * Branch - CatalogRef.BusinessUnits -
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	AccessKeyStructure.Insert("Company", Catalogs.Companies.EmptyRef());
	AccessKeyStructure.Insert("Branch", Catalogs.BusinessUnits.EmptyRef());
	Return AccessKeyStructure;
EndFunction

#EndRegion

// Additional data filling.
// 
// Parameters:
//  MovementsValueTable - ValueTable
Procedure AdditionalDataFilling(MovementsValueTable) Export
	Return;	
EndProcedure
